# Shaquille Obomeghie

1. import libraries
2. Import customer data
3. Wrangle Data
4. Data Quality and Consistency check 
5. Combining customer Data and instacart data
6. Export Data as Pickle

### 1. Import Libraries

In [1]:
# Import libraries 
import pandas as pd
import numpy as np 
import os 
import matplotlib.pyplot as plt
import seaborn as sns 
import scipy

### 2. Import customer data

In [2]:
path = r'/Users/shaquillelee/Documents/Instacart Basket Analysis'

In [3]:
# Load Customer Data 
customer = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'))

In [4]:
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
#Checking the dimension of the customer Data Frame 
customer.shape

(206209, 10)

### 3. Wrangle Data

The columns in these data are not uniformly name. We have to make it uniform.

In [6]:
# Rename First Name 
customer.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [7]:
# Rename Surname
customer.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [8]:
# Rename Gender
customer.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [9]:
# Rename STATE 
customer.rename(columns = {'STATE' : 'state'}, inplace = True)

In [10]:
# Rename Age
customer.rename(columns = {'Age' : 'age'}, inplace = True)

In [11]:
# Rename n_dependants
customer.rename(columns = {'n_dependants' : 'no_of_dependants'}, inplace = True)

In [12]:
# Rename fam_status
customer.rename(columns = {'fam_status' : 'martial_status'}, inplace = True)

I will not be dropping any columns because all columns be useful in undertsanding purchasing trends of customers

### 4. Data quality and consistency checks

In [13]:
customer.head()

,user_id,first_name,surname,gender,state,age,date_joined,no_of_dependants,martial_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [14]:
# Checking the statistics of the data frame
customer.describe()

             user_id            age  no_of_dependants         income
count  206209.000000  206209.000000     206209.000000  206209.000000
mean   103105.000000      49.501646          1.499823   94632.852548
std     59527.555167      18.480962          1.118433   42473.786988
min         1.000000      18.000000          0.000000   25903.000000
25%     51553.000000      33.000000          0.000000   59874.000000
50%    103105.000000      49.000000          1.000000   93547.000000
75%    154657.000000      66.000000          3.000000  124244.000000
max    206209.000000      81.000000          3.000000  593901.000000

In [15]:
# Checking the dimension of the data 
customer.shape

(206209, 10)

In [16]:
customer.dtypes

user_id              int64
first_name          object
surname             object
gender              object
state               object
age                  int64
date_joined         object
no_of_dependants     int64
martial_status      object
income               int64
dtype: object

In [17]:
# Checking for mixed data in the dataframe 
for col in customer.columns.tolist():
  weird = (customer[[col]].map(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col)

first_name

In [18]:
# User_id and first_name both have to be changed to string values 
customer['user_id'] = customer['user_id'].astype('str')
customer['first_name'] = customer['first_name'].astype('str')

In [19]:
# Booth user_id and first_name data types have be changed 
customer.dtypes

user_id             object
first_name          object
surname             object
gender              object
state               object
age                  int64
date_joined         object
no_of_dependants     int64
martial_status      object
income               int64
dtype: object

In [20]:
# Checking if there is any missing values in the dataframe 
customer.isnull().sum()

user_id             0
first_name          0
surname             0
gender              0
state               0
age                 0
date_joined         0
no_of_dependants    0
martial_status      0
income              0
dtype: int64

No missing values found

In [21]:
#Checking for duplicate value
customer_dup = customer[customer.duplicated()]

In [22]:
customer_dup

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, no_of_dependants, martial_status, income]
Index: []

No duplicate data was found

### 5. Combining customer data and instacart data

In [23]:
# import instacart data 
prod_ords = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_prods_group.pkl'))

In [24]:
prod_ords.head()

,order_id,user_identity_number,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,Busiest_day,Busiest_days,busiest_period_of_the_day,max_order,loyalty_flag,average_price,Spending,median_days_since_prior_order,order_regularity
0,2539329.0,1.0,1.0,2.0,8.0,7.0,196,1.0,0.0,Soda,...,Mid-range Products,Regularly busy,Regularly busy,Average Orders,10.0,New Customer,6.367797,Low Spender,20.0,Regular customer
1,2398795.0,1.0,2.0,3.0,7.0,15.0,196,1.0,1.0,Soda,...,Mid-range Products,Regularly busy,Slowest days,Average Orders,10.0,New Customer,6.367797,Low Spender,20.0,Regular customer
2,473747.0,1.0,3.0,3.0,12.0,21.0,196,1.0,1.0,Soda,...,Mid-range Products,Regularly busy,Slowest days,Most Orders,10.0,New Customer,6.367797,Low Spender,20.0,Regular customer
3,2254736.0,1.0,4.0,4.0,7.0,29.0,196,1.0,1.0,Soda,...,Mid-range Products,Least Busy,Slowest days,Average Orders,10.0,New Customer,6.367797,Low Spender,20.0,Regular customer
4,431534.0,1.0,5.0,4.0,15.0,28.0,196,1.0,1.0,Soda,...,Mid-range Products,Least Busy,Slowest days,Most Orders,10.0,New Customer,6.367797,Low Spender,20.0,Regular customer

In [25]:
customer.head()

,user_id,first_name,surname,gender,state,age,date_joined,no_of_dependants,martial_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

Both dataframes have user_id. That is the key connecting them

In [26]:
# Checking the dimension of the prod_ords dataframe 
prod_ords.shape

(32406041, 24)

In [27]:
# Expand all columns 
pd.set_option('display.max_columns', None)

In [28]:
# Rename user_identity_number to user_id 
prod_ords.rename(columns = {'user_identity_number' : 'user_id'}, inplace = True)

In [29]:
# Checking the data type of user_id in the prod_ords data fram beacsue the data type of the key of both dataframes have to match 
prod_ords.dtypes['user_id']

dtype('float64')

In [30]:
prod_ords['user_id'] = prod_ords['user_id'].astype(str)
prod_ords['user_id'] = prod_ords['user_id'].str.strip()
prod_ords['user_id'] = pd.to_numeric(prod_ords['user_id'], errors='coerce').astype('Int64')
prod_ords.dropna(subset=['user_id'], inplace=True)
prod_ords['user_id'] = prod_ords['user_id'].astype(int)

In [31]:
prod_ords['order_number'] = prod_ords['order_number'].astype(str)
prod_ords['order_number'] = prod_ords['order_number'].str.strip()
prod_ords['order_number'] = pd.to_numeric(prod_ords['user_id'], errors='coerce').astype('Int32')
prod_ords.dropna(subset=['order_number'], inplace=True)
prod_ords['order_number'] = prod_ords['order_number'].astype(int)

In [32]:
prod_ords['orders_day_of_week'] = prod_ords['orders_day_of_week'].astype(str)
prod_ords['orders_day_of_week'] = prod_ords['orders_day_of_week'].str.strip()
prod_ords['orders_day_of_week'] = pd.to_numeric(prod_ords['orders_day_of_week'], errors='coerce').astype('Int32')
prod_ords.dropna(subset=['orders_day_of_week'], inplace=True)
prod_ords['orders_day_of_week'] = prod_ords['orders_day_of_week'].astype(int)

In [33]:
prod_ords['order_hour_of_day'] = prod_ords['order_hour_of_day'].astype(str)
prod_ords['order_hour_of_day'] = prod_ords['order_hour_of_day'].str.strip()
prod_ords['order_hour_of_day'] = pd.to_numeric(prod_ords['order_hour_of_day'], errors='coerce').astype('Int32')
prod_ords.dropna(subset=['order_hour_of_day'], inplace=True)
prod_ords['order_hour_of_day'] = prod_ords['order_hour_of_day'].astype(int)

In [34]:
prod_ords['days_since_prior_order'] = prod_ords['days_since_prior_order'].astype(str)
prod_ords['days_since_prior_order'] = prod_ords['days_since_prior_order'].str.strip()
prod_ords['days_since_prior_order'] = pd.to_numeric(prod_ords['days_since_prior_order'], errors='coerce').astype('Int32')
prod_ords.dropna(subset=['days_since_prior_order'], inplace=True)
prod_ords['days_since_prior_order'] = prod_ords['days_since_prior_order'].astype(int)

In [35]:
prod_ords['department_id'] = prod_ords['department_id'].astype(str)
prod_ords['department_id'] = prod_ords['department_id'].str.strip()
prod_ords['department_id'] = pd.to_numeric(prod_ords['department_id'], errors='coerce').astype('Int32')
prod_ords.dropna(subset=['department_id'], inplace=True)
prod_ords['department_id'] = prod_ords['department_id'].astype(int)

In [36]:
# Changing 'user_id' in 'prod_ords' to 'str'
prod_ords['user_id'] = prod_ords['user_id'].astype('str')

In [37]:
prod_ords['user_id'].dtypes

dtype('O')

In [38]:
#Dropping the already show '_merge' column in the data frame 
prod_ords = prod_ords.drop(columns = ['_merge'])

In [39]:
# Merging the prod_ords to customer dataframe 
df_merged = prod_ords.merge(customer, on = 'user_id', indicator = True, how = 'inner')

In [40]:
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,price_range_loc,Busiest_day,Busiest_days,busiest_period_of_the_day,max_order,loyalty_flag,average_price,Spending,median_days_since_prior_order,order_regularity,first_name,surname,gender,state,age,date_joined,no_of_dependants,martial_status,income,_merge
0,2539329.0,1,1,2,8,7,196,1.0,0.0,Soda,77.0,7,9.0,Mid-range Products,Regularly busy,Regularly busy,Average Orders,10.0,New Customer,6.367797,Low Spender,20.0,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795.0,1,1,3,7,15,196,1.0,1.0,Soda,77.0,7,9.0,Mid-range Products,Regularly busy,Slowest days,Average Orders,10.0,New Customer,6.367797,Low Spender,20.0,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747.0,1,1,3,12,21,196,1.0,1.0,Soda,77.0,7,9.0,Mid-range Products,Regularly busy,Slowest days,Most Orders,10.0,New Customer,6.367797,Low Spender,20.0,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736.0,1,1,4,7,29,196,1.0,1.0,Soda,77.0,7,9.0,Mid-range Products,Least Busy,Slowest days,Average Orders,10.0,New Customer,6.367797,Low Spender,20.0,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534.0,1,1,4,15,28,196,1.0,1.0,Soda,77.0,7,9.0,Mid-range Products,Least Busy,Slowest days,Most Orders,10.0,New Customer,6.367797,Low Spender,20.0,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [41]:
#Checking the dimension of the merged dataframe
df_merged.shape

(32406041, 33)

In [42]:
#Check Value coount of '_merge' column 
df_merged['_merge'].value_counts()

_merge
both          32406041
left_only            0
right_only           0
Name: count, dtype: int64

In [43]:
df_merged.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'Busiest_day',
       'Busiest_days', 'busiest_period_of_the_day', 'max_order',
       'loyalty_flag', 'average_price', 'Spending',
       'median_days_since_prior_order', 'order_regularity', 'first_name',
       'surname', 'gender', 'state', 'age', 'date_joined', 'no_of_dependants',
       'martial_status', 'income', '_merge'],
      dtype='object')

### 6. Export Dataframe as pickle

In [44]:
df_merged.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'customer_product_order.pkl'))